/******************** (C) COPYRIGHT 2014 Air Nano Team ***************************
 * 文件名  ：led.c
 * 描述    ：led函数应用
 * 实验平台：Air Nano四轴飞行器
 * 库版本  ：ST3.5.0
 * 作者    ：Air Nano Team
 * 淘宝    ：http://byd2.taobao.com
**********************************************************************************/

#include "Algorithm_filter.h"



/*====================================================================================================*/
/*====================================================================================================*
** 函数名称: IIR_I_Filter
** 功能描述: IIR直接I型滤波器
** 输    入: InData 为当前数据
**           *x     储存未滤波的数据
**           *y     储存滤波后的数据
**           *b     储存系数b
**           *a     储存系数a
**           nb     数组*b的长度
**           na     数组*a的长度
**           LpfFactor
** 输    出: OutData
** 说    明: 无
** 函数原型: y(n) = b0*x(n) + b1*x(n-1) + b2*x(n-2) -
					a1*y(n-1) - a2*y(n-2)
**====================================================================================================*/
/*====================================================================================================*/
float IIR_I_Filter(float InData, float *x, float *y, float *b, short nb, float *a, short na) {
	float z1, z2;
	short i;
	float OutData;

	for (i = nb - 1; i > 0; i--) {
		x[i] = x[i - 1];
	}

	x[0] = InData;

	for (z1 = 0, i = 0; i < nb; i++) {
		z1 += x[i] * b[i];
	}

	for (i = na - 1; i > 0; i--) {
		y[i] = y[i - 1];
	}

	for (z2 = 0, i = 1; i < na; i++) {
		z2 += y[i] * a[i];
	}

	y[0] = z1 - z2;
	OutData = y[0];

	return OutData;
}

/*====================================================================================================*/
/*====================================================================================================*
**函数 : KalmanFilter
**功能 : 卡尔曼滤波
**输入 :
**輸出 : None
**备注 : None
**====================================================================================================*/
/*====================================================================================================*/
float KalmanFilter(const float ResrcData, float ProcessNiose_Q, float MeasureNoise_R, float x_last, float p_last) {
	float R = MeasureNoise_R;
	float Q = ProcessNiose_Q;
	float x_mid = x_last;
	float x_now;
	float p_mid;
	float p_now;
	float kg;

	x_mid = x_last;          //x_last=x(k-1|k-1),x_mid=x(k|k-1)
	p_mid = p_last + Q;        //p_mid=p(k|k-1),p_last=p(k-1|k-1),Q=噪声
	kg = p_mid / (p_mid + R);    //kg为kalman filter，R为噪声
	x_now = x_mid + kg*(ResrcData - x_mid);//估计出的最优值

	p_now = (1 - kg)*p_mid;   //最优值对应的covariance       
	p_last = p_now;       //更新covariance值
	x_last = x_now;       //更新系统状态值
	return x_now;
}
/*====================================================================================================*/
/*====================================================================================================*
**函数 : LPF_1st
**功能 : 一阶低通滤波
**输入 :
**輸出 : None
**备注 : None
**====================================================================================================*/
/*====================================================================================================*/
void LPF_1st(float *oldData, float *newData, float lpf_factor) {
	(*newData) = (*oldData) * (1 - lpf_factor) + (*newData) * lpf_factor;
	(*oldData) = (*newData);
}

/******************* (C) COPYRIGHT 2012 WildFire Team *****END OF FILE************/
